tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/bundle"

## 1. Chat / Call
cask "telegram" 
cask "whatsapp" 
cask "zoom" 
cask "slack"
# ----
# cask "skype"
# cask "discord" 

## 2. Media
cask "spotify" 
cask "vlc" 
# preview (default)
# ----
# stremio

## 3. Office
cask "google-drive" 
cask "foxitreader" 
# cask "microsoft-word/excel/powerpoint"
# google docs/sheets/slides
# textedit (default)
# freeform (default)

## 4. Productivity
cask "marta"
cask "brave-browser"
# safari (default)
cask "iterm2"
cask "cursor"
cask "arduino-ide"
cask "chatgpt"
cask "claude"
# ----
# cask "visual-studio-code"
# cask "postman"
# cask "docker" 
# cask "openlens"

## 5. Settings
# app store (default)
# system preferences (default)
# activity monitor (default)
# mission control (default)
# find my (default)

## 6. Tools
# calculator (default)
# photo boot (default)
# ledger-live (manually)
cask "the-unarchiver" 
cask "rectangle" 
mas "Horo", id: 1437226581
cask "raycast"
cask "macmediakeyforwarder"
cask "clocker"
cask "evernote"
# ----
# cask "send-to-kindle"
# protonvpn (manually)
# cask "aldente"
# mas "Pocket", id: 568494494
# tableplus
# wireshark
# amphetamine
# loom
# deepl
# duplicate-file-finder

## Development tools
brew "pre-commit"
# brew "composer"
# brew "ruby"
# brew "python"
brew "awscli"
# brew "node"
brew "antigen"
brew "zsh"

## System tools
brew "git"
brew "curl"
# brew "nmap"
brew "wget"
brew "grep"
brew "tree"
brew "watch"
brew "telnet"
brew "gcc"
brew "openssl"
brew "jq"
brew "gnu-tar"
brew "gnu-sed"
brew "gnu-time"
brew "gnu-which"
brew "gnutls"
brew "gnupg"
brew "mas"
# brew "ansible" 
# brew "eksctl"
# brew "helm"

## Terraform tools
# brew "tfenv"
# brew "tflint"
# brew "tfsec"
# tap "coretech/terrafile"
# brew "terrafile"
# brew "terraform-docs"
# tap "gofireflyio/aiac"
# brew "aiac"
# brew "terrascan"