tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/bundle"

## 1. Chat / Call
cask "slack"
cask "discord" 
cask "telegram" 
cask "whatsapp" 
# cask "zoom" 

## 2. Media
cask "spotify" 
cask "vlc" 
# preview 

## 3. Office
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "adobe-acrobat-reader" 
cask "google-drive" 
# textedit 

## 4. Productivity
cask "marta"
cask "google-chrome"
cask "brave-browser"
cask "iterm2"
cask "visual-studio-code"
cask "postman"
cask "docker" 
cask "arduino-ide"
# safari
# cask "virtualbox"
# cask "minikube"

## 5. Settings
# app store 
# system preferences 
# activity monitor 
# mission control 
# find my 

## 6. Tools
cask "simplenote" 
cask "authy" 
cask "send-to-kindle"
cask "rectangle" 
cask "the-unarchiver" 
cask "raycast"
cask "macmediakeyforwarder"
cask "clocker"
cask "aldente"
mas "Horo", id: 1437226581
mas "Pocket", id: 568494494
# photo boot 
# calculator 
# duplicate-file-finder
# tableplus
# wireshark
# amphetamine
# ledger
# raycast
# protonvpn

## Development tools
brew "pre-commit"
# brew "composer"
# brew "ruby"
# brew "python"
brew "awscli"
brew "node"
brew "antigen"
brew "zsh"

## System tools
brew "git"
brew "curl"
brew "nmap"
brew "wget"
brew "grep"
brew "tree"
brew "watch"
brew "telnet"
brew "gcc"
brew "openssl"
brew "jq"
brew "gnu-tar"
brew "gnu-sed"
brew "gnu-time"
brew "gnu-which"
brew "gnutls"
brew "gnupg"
brew "mas"

## Terraform tools
brew "tfenv"
brew "tflint"
brew "tfsec"
tap "coretech/terrafile"
brew "terrafile"
brew "terraform-docs"
# tap "gofireflyio/aiac"
# brew "aiac"
# brew "terrascan"

## VS Code Plugins
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "nhoizey.gremlins"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "SebastienMa.ansi-color-code"
vscode "timkmecl.chatgpt"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "ZainChen.json"
