cask_args appdir: "/Applications"
# tap 'caskroom/cask'
#tap homebrew/cask
#tap homebrew/cask-fonts
#tap homebrew/core

# brew install BLA = brew BLA
# brew install --cask  BLA = cask BLA

## Chat / Call
cask "zoom" 
cask "slack"
cask "discord" 
cask "telegram" 
cask "whatsapp" 
cask "microsoft-teams" 

## Media
cask "spotify" 
cask "vlc" 
# preview 
# stremio 

## Office
#cask "microsoft-excel"
#cask "microsoft-word"
#cask "microsoft-powerpoint"
cask "adobe-acrobat-reader" 
cask "google-drive" 
# textedit 

### Productivity
cask "marta"
cask "iterm2"
# safari
cask "firefox"
cask "google-chrome"
cask "brave-browser"
cask "visual-studio-code"
cask "postman"
cask "docker" 
# cask "gh"
# virtualbox
# vagrant
# arduino
# minikube

### Settings
# app store 
# system preferences 
# activity monitor 
# mission control 
# find my 

### Tools
cask "simplenote" 
# calculator 
# photo boot 
cask "authy" 
cask "rectangle" 
cask "the-unarchiver" 
cask "kindle"
mas "Horo", id: 1437226581
mas "Pocket", id: 568494494
cask "macmediakeyforwarder"
#mas "Boop", id: 1518425043
#mas "Duplicate File Finder", id: 1032755628
# tableplus
# wireshark
# clocker
# amphetamine

### Development tools
brew "pre-commit"
brew "mongosh"
#brew "composer"
#brew "ruby"
brew "awscli"
brew "antigen"

### System tools
brew "git"
brew "curl"
brew "nmap"
brew "wget"
brew "gnupg"
brew "grep"
brew "tree"
brew "watch"
brew "telnet"
brew "gcc"
brew "openssl"
brew "jq"
brew "gnu-tar"
brew "gnu-sed"
brew "gnu-time"
brew "gnu-which"

### Terraform tools
#brew "terraform-docs"
#brew "terrascan"
brew "tfenv"
brew "tflint"
brew "tfsec"
tap "coretech/terrafile"
brew "terrafile"